In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [33]:
data = 'Datasets/Air and Sea Travel Statistics/ASA01.csv'

df = pd.read_csv(data)
df

,STATISTIC Label,Year,Direction,Mode,UNIT,VALUE
0,Air and Sea Travel,2010,Arrivals,All modes of transport,Thousand,12902.2
1,Air and Sea Travel,2010,Arrivals,Air,Thousand,11400.6
2,Air and Sea Travel,2010,Arrivals,Sea,Thousand,1501.7
3,Air and Sea Travel,2010,Departures,All modes of transport,Thousand,12920.2
4,Air and Sea Travel,2010,Departures,Air,Thousand,11425.3
...,...,...,...,...,...,...
79,Air and Sea Travel,2023,Arrivals,Air,Thousand,19481.0
80,Air and Sea Travel,2023,Arrivals,Sea,Thousand,1144.6
81,Air and Sea Travel,2023,Departures,All modes of transport,Thousand,20626.2
82,Air and Sea Travel,2023,Departures,Air,Thousand,19476.1
83,Air and Sea Travel,2023,Departures,Sea,Thousand,1150.1

In [37]:
# First, let's make the requested renamings in the original DataFrame
df_renamed = df.replace({
    'All modes of transport': 'Total',
    'Arrivals Total': 'Arrivals Total',
    'Departures Total': 'Departures Total'
})

# Then pivot the DataFrame to get 'VALUE' transposed into columns labeled '[DIRECTION] [Mode]'
df_pivoted = df_renamed.pivot_table(index='Year', columns=['Direction', 'Mode'], values='VALUE')

# Flatten the MultiIndex columns and sort them alphabetically, also rename columns to combine Direction and Mode
df_pivoted.columns = [' '.join(col).strip() for col in df_pivoted.columns.values]
df_pivoted = df_pivoted.reindex(sorted(df_pivoted.columns), axis=1)

# Reset index to make 'Year' a column and not an index label
df_pivoted.reset_index(inplace=True)

# Display the first few rows of the transformed DataFrame
df_pivoted

,Year,Arrivals Air,Arrivals Sea,Arrivals Total,Departures Air,Departures Sea,Departures Total
0,2010,11400.6,1501.7,12902.2,11425.3,1494.9,12920.2
1,2011,11647.5,1402.2,13049.7,11707.1,1402.5,13109.7
2,2012,11806.7,1335.3,13142.0,11839.7,1321.9,13161.6
3,2013,12287.7,1345.2,13632.9,12314.5,1340.7,13655.2
4,2014,13138.8,1408.0,14546.8,13169.5,1401.0,14570.5
5,2015,14744.6,1355.6,16100.3,14790.4,1348.1,16138.5
6,2016,16232.4,1300.2,17532.6,16318.9,1289.2,17608.1
7,2017,17076.0,1323.3,18399.4,17139.8,1309.0,18448.8
8,2018,18102.2,1293.7,19395.9,18180.6,1275.7,19456.3
9,2019,18907.5,1236.2,20143.7,18975.1,1230.3,20205.3
10,2020,4135.7,324.5,4460.2,4114.7,338.0,4452.6
11,2021,4516.6,439.3,4955.9,4559.4,462.6,5022.0
12,2022,16193.2,1063.8,17257.0,16117.4,1054.9,17172.3
13,2023,19481.0,1144.6,20625.6,19476.1,1150.1,20626.2

In [39]:
df_pivoted.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Year              14 non-null     int64
 1   Arrivals Air      14 non-null     float64
 2   Arrivals Sea      14 non-null     float64
 3   Arrivals Total    14 non-null     float64
 4   Departures Air    14 non-null     float64
 5   Departures Sea    14 non-null     float64
 6   Departures Total  14 non-null     float64
dtypes: float64(6), int64(1)
memory usage: 912.0 bytes

In [45]:
df_described_no_year = df_pivoted.drop(columns=['Year']).describe()
df_described_no_year

,Arrivals Air,Arrivals Sea,Arrivals Total,Departures Air,Departures Sea,Departures Total
count,14.000000,14.000000,14.000000,14.000000,14.000000,14.000000
mean,13547.892857,1176.685714,14724.585714,13580.607143,1172.778571,14753.378571
std,4771.033748,354.452974,5010.327735,4779.974977,345.456430,5011.889370
min,4135.700000,324.500000,4460.200000,4114.700000,338.000000,4452.600000
25%,11687.300000,1167.500000,13072.775000,11740.250000,1170.150000,13122.675000
50%,13941.700000,1311.750000,15323.550000,13979.950000,1299.100000,15354.500000
75%,16865.100000,1353.000000,18182.700000,16934.575000,1346.250000,18238.625000
max,19481.000000,1501.700000,20625.600000,19476.100000,1494.900000,20626.200000